---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BaseArray
source: html/7554d307-ac89-1bc3-23ed-3b11e2f3fddd.htm
---
# BaseArray Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.